day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/pipe3D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.568e-05;

//Air at 300K
//rho = 1.177
//nu  = 1.568e-5
//mu  = 1.846e-05;
//Pr  = 0.707;
//Cp  = 1004;

// ************************************************************************* //
