day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/pipe3D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

setFormat raw;

surlineFaceFormat null;

//interpolationScheme cell;
//interpolationScheme cellPoint;
interpolationScheme cellPointFace;

// Fields to sample.
fields
(
    U
    p
);

sets
(

    s1
    {
        type            lineCellFace;
        //type            lineCell;
        //type            lineFace;

        //type            lineUniform;
	//nPoints 	24;

        axis            z;
        start           (0 0 0);
        end             (0 0 0.22);
    }

    s2
    {
        type            lineCellFace;
        //type            lineCell;
        //type            lineFace;

        //type            lineUniform;
	//nPoints 	100;

        axis            x;
        start           (-0.002  -0.002 0.2);
        end             ( 0.002   0.002 0.2);
    }
);

surlineFaces
(
);

// *********************************************************************** //
